{
  "basics": {
    "name": "Matthew Downs",
    "label": "Software Engineer/Technical Consultant/Scrum Master",
    "email": "downs.matt@gmail.com",
    "phone": "(415) 498-0446",
    "website": "https://registry.jsonresume.org/matthewdowns",
    "summary": "Results-proven, motivated, creative engineer, solutions architect, and technical consultant developing in React, JavaScript, and Ruby",
    "location": {
      "address": "1588 Indiana St. Apt. 10",
      "postalCode": "CA 94107",
      "city": "San Francisco",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/matthewadowns/"
      },
      {
        "network": "GitHub",
        "username": "theUtherSide",
        "url": "https://github.com/theUtherSide"
      }
    ]
  },
  "work": [
    {
      "company": "Demandbase",
      "position": "Senior Software Engineer",
      "website": "https://demandbase.com",
      "startDate": "2015-01-01",
      "summary": "",
      "highlights": [
        "Architect and owner of a cross-browser JavaScript library for delivering, collecting, and integrating advertising/marketing data streams.",

        "Lead engineer and product manager for platform integrations into strategic vendor applications (including Adobe, Salesforce, Marketo, Google) leading to millions in new revenue from enterprise clients.",

        "Key contributor playing multiple roles on an agile Scrum team building an enterprise SaaS platform.",

        "Design, develop, deploy APIs, microservices, platform features, JavaScript assets for partners and internal users enabling intake of billions of records per month across thousands of websites."
      ]
    },
    {
      "company": "Demandbase",
      "position": "Senior Solutions Engineer/Consultant",
      "startDate": "2012-05-18",
      "endDate": "2014-12-31",
      "summary": "As the inaugural member of the services team, provided technical consulting and elegant integrations into the Demandbase Platform for customers of all sizes.",
      "highlights": [
        "Defined key roles and processes in the services organization while leading the implementation process with customers, distributed teams, and partners.",

        "Built solutions and facilitated implementations from requirements through deployment helping to secure millions in new business and renewals.",

        "Applied agile methodologies to build JavaScript libraries and easy-to-deploy, reusable integrations into various business systems, including Adobe Marketing Cloud, Google Analytics, Marketo, Eloqua, WordPress, and Drupal.",

        "Lead client implementation projects, defined and delivered new service offerings, documentation, technical trainings, best practices and client engagement framework."
      ]
    },
    {
      "company": "Big Machines (now Oracle CPQ)",
      "position": "Senior Implementation Engineer, Professional Services",
      "startDate": "2009-12-09",
      "endDate": "2012-05-10",
      "summary": "Tech Lead and Solution Architect for key enterprise customers, discovered and documented business processes and requirements, developed requirements into innovative designs, coded and configured solutions while managing project quality and scope.",
      "highlights": [
        "Configured and coded BigMachines application functionality rapidly developing and deploying best-in-class integrated solutions.",

        "Trained business users and system administrators on the BigMachines platform, including conducting training sessions and producing high-quality documentation.",

        "Demonstrated design skilss as a User Experience Specialist, reviewed and refined visual and usability aspects of solution design."
      ]
    },
    {
      "company": "Intuit, Inc.",
      "position": "Senior Implementation Engineer, Professional Services",
      "website": "https://www.intuit.com/",
      "startDate": "2008-06-01",
      "endDate": "2009-12-01",
      "summary": "Java web application developer for payroll and accounting products for small businesses",
      "highlights": [
        "Owned product features and improved customer experience on a customer-driven, business-aware team, maintaining steady iterations and releases.",

        "Accelerated development by improving processes and communication; Coordinated with marketing team to contribute to steep growth in users.",

        "Collaborated on initiatives for architecture improvements, standards compliance, and user studies",

        "Submitted original ideas for patent review for interfaces, features and financial/healthcare products.",

        "Utilized 10-20% unstructured time for innovation-driven engineering activities; Contributed design, development, and business analysis to creative side projects."
      ]
    },
    {
      "company": "Cooper Tire and Rubber",
      "position": "Software Developer",
      "website": "http://us.coopertire.com/",
      "startDate": "2005-08-01",
      "endDate": "2007-08-01",
      "summary": "In-house .NET developer at a major manufacturing company",
      "highlights": [
        "Lead developer on fast-paced, customer-driven team on key application for improving business processes for LEAN manufacturing organization (ASP/VB .NET/Oracle)",

        "Performed business requirements analysis with internal clients; co-authored software design documents and feature requirements for logistics and manipulating factory machinery",

        "Designed and built Crystal Reports, Oracle stored procedures and accompanying web application features"
      ]
    }
  ],
  "education": [
    {
      "institution": "Ohio Northern University",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2003-08-24",
      "endDate": "2008-05-25"
    }
  ],
  "skills": [
    {
      "name": "Front-end web development",
      "keywords": [
        "ReactJS",
        "JavaScript",
        "HTML5",
        "SCSS/CSS3",
        "Grunt, Gulp, webpack"
      ]
    },
    {
      "name": "Back-end Ruby development",
      "keywords": [
        "Rails",
        "Rack",
        "RSpec",
        "APIs",
        "integrations"
      ]
    },
    {
      "name": "Technical consulting",
      "keywords": [
        "solutions implementation",
        "business analysis",
        "user training"
      ]
    },
    {
      "name": "Technical writing",
      "keywords": [
        "user stories",
        "test cases",
        "requirements",
        "business processes",
        "documentation"
      ]
    }
  ],
  "interests": [
    { "name": "collage" },
    { "name": "gardening" },
    { "name": "fermentation" },
    { "name": "Permaculture" },
    { "name": "skiing" },
    { "name": "hiking" },
    { "name": "camping" }
  ],
  "references": [
    {
      "reference": "Available upon request."
    }
  ]
}
